{
  "Caldwell": [
    {
      "id": 0,
      "line": [
        "Halt! Who goes there?",
        "Corbyn?",
        "Is that you?"
      ],
      "responses": [
        {
          "quip": "Caldwell! It's been a while! I hope the guard life has been treating you well.",
          "target": 1
        },
        {
          "quip": "It is! It's nice to see you again, Caldwell. How have you been?",
          "target": 2
        },
        {
          "quip": "Caldwell, I don't have much time. Do you know where my mother is?",
          "target": 3
        }
      ]
    },
    {
      "id": 1,
      "line": [
        "There was a time when it was quite frightening for us. But we're a tough bunch, we got through."
      ],
      "responses": [
        {
          "quip": "Tough? Ha! Stubborn, more like.",
          "target": 4
        },
        {
          "quip": "You guys are the real heroes. You could've fought those evil monsters without me.",
          "target": 5
        }
      ]
    },
    {
      "id": 2,
      "line": [
        "Well, ever since the monsters stopped attacking, life has been smooth sailing.",
        "Seeing that you are back in one piece I suppose I have you to thank for that."
      ],
      "responses": [
        {
          "quip": "No thanks is necessary, I think anyone with the will could have done it.",
          "target": 6
        },
        {
          "quip": "I suppose so, but it was not without hardships. Speaking of which, do you know where my mother is?",
          "target": 3
        }
      ]
    },
    {
      "id": 3,
      "line": [
        "Your mother? She doesn't leave home very often nowadays, I bet she's there now. Is everything alright?"
      ],
      "responses": [
        {
          "quip": "Of course, I just want to see her most of all.",
          "target": 7
        },
        {
          "quip": "No, I need to see her immediately. Goodbye Caldwell.",
          "target": -1
        }
      ]
    },
    {
      "id": 4,
      "line": [
        "Well that might be true, but we're still kicking reguardless.",
        "I assume you are looking to see your mother?"
      ],
      "responses": [
        {
          "quip": "I am, could you point me in her direction?",
          "target": 8
        }
      ]
    },
    {
      "id": 5,
      "line": [
        "Oh I doubt that, but on behalf of the town, thank you for your kind words.",
        "I assume you came back to see your mother?"
      ],
      "responses": [
        {
          "quip": "I am, could you point me in her direction?",
          "target": 8
        }
      ]
    },
    {
      "id": 6,
      "line": [
        "That's very humble of you. Now's the time for the hero to return home now though, eh?",
        "I assume you are going to see your mother?"
      ],
      "responses": [
        {
          "quip": "My mother will always be there. I want to talk to you, Caldwell.",
          "target": 9
        },
        {
          "quip": "I would like that very much.",
          "target": 10
        }
      ]
    },
    {
      "id": 7,
      "line": [
        "Ah, that would make sense. I'll let you get to that then. It's nice to see you home."
      ],
      "responses": [
        {
          "quip": "It's nice to see you too, Caldwell. Goodbye.",
          "target": -1
        }
      ]
    },
    {
      "id": 8,
      "line": [
        "She doesn't leave home too often nowadays. I bet she's there now."
      ],
      "responses": [
        {
          "quip": "Thanks Caldwell, I'll talk with you later.",
          "target": -1
        },
        {
          "quip": "Goodbye, Caldwell.",
          "target": -1
        }
      ]
    },
    {
      "id": 9,
      "line": [
        "That's very kind of you but I should probably get back to work.",
        "Besides, I know the other townsfolk would be thrilled to talk with you as well. We can talk some more later."
      ],
      "responses": [
        {
          "quip": "I'll hold you to that. Goodbye, Caldwell.",
          "target": -1
        }
      ]
    },
    {
      "id": 10,
      "line": [
        "Ah, you should find her at home then. It's nice to see you well, Corbyn."
      ],
      "responses": [
        {
          "quip": "Thanks for your help. Nice seeing you too.",
          "target": -1
        }
      ]
    }
  ],
  "Finn": [
    {
      "id": 0,
      "line": [
        "CORBYN! YOU'RE BACK!"
      ],
      "responses": [
        {
          "quip": "Finn! It's nice to see you man.",
          "target": 1
        },
        {
          "quip": "Hey Finn, excitable as always I see.",
          "target": 2
        },
        {
          "quip": "It's nice to see you, Finn, but I need to go.",
          "target": 3
        }
      ]
    },
    {
      "id": 1,
      "line": [
        "You know it! How you been, man? Tell me about your adventures!",
        "Oh Great Corbyn; tamer of beasts, slayer of dragons, controller of..."
      ],
      "responses": [
        {
          "quip": "Okay, okay, I get it. Sure, I've got a story I could tell you.",
          "target": 4
        }
      ]
    },
    {
      "id": 2,
      "line": [
        "How could I not be when I've heard that my best friend is back from savin' the world?"
      ],
      "responses": [
        {
          "quip": "You are too kind, Finn.",
          "target": 5
        },
        {
          "quip": "You could have done it, Finn. I'm not special.",
          "target": 6
        }
      ]
    },
    {
      "id": 3,
      "line": [
        "Where you headed my man? I could go with you."
      ],
      "responses": [
        {
          "quip": "Thank you, Finn, but that won't be necessary. I'm going to see my mother.",
          "target": 7
        },
        {
          "quip": "No, Finn. Good bye.",
          "target": -1
        }
      ]
    },
    {
      "id": 4,
      "line": [
        "I am always down for a story, but I don't really have time for a long one. You got the short and sweet kind too?"
      ],
      "responses": [
        {
          "quip": "Sure man. Is Slider still around? I haven't seen that old mutt yet.",
          "target": 8
        },
        {
          "quip": "Maybe we should just save the tales for later, I imagine you're skipping out on work right now?",
          "target": 9
        }
      ]
    },
    {
      "id": 5,
      "line": [
        "Says the man who literally saved us from becoming some gross demon slaves or something."
      ],
      "responses": [
        {
          "quip": "What are you even talking about?",
          "target": 10
        },
        {
          "quip": "You're being weird again, Finn.",
          "target": 11
        }
      ]
    },
    {
      "id": 6,
      "line": [
        "Yeah, sure. Whatever you say, mister Humble Corbyn. Anyways, you have anything you want to do now that you're back in town?"
      ],
      "responses": [
        {
          "quip": "Not much, just checking in with everybody as I go.",
          "target": 12
        },
        {
          "quip": "Yes, I'm on my way to see my mom.",
          "target": 13
        }
      ]
    },
    {
      "id": 7,
      "line": [
        "Oh, alright. I suppose we'll talk later then?"
      ],
      "responses": [
        {
          "quip": "Of course, Finn. See you later.",
          "target": -1
        },
        {
          "quip": "Maybe. Good bye, Finn.",
          "target": -1
        }
      ]
    },
    {
      "id": 8,
      "line": [
        "Of course he is. That dog's never goin' to heaven, man."
      ],
      "responses": [
        {
          "quip": "Wonderful. Well, I haven't told anyone yet, but I saw Slider outside the walls last time I stopped by.",
          "target": 14
        }
      ]
    },
    {
      "id": 9,
      "line": [
        "Who, me? Finn the, uhh...",
        "Faithful?",
        "I should get back to work. I'm already planning your welcome party now, man. You best not pee yourself when we surprise you like you did last time!"
      ],
      "responses": [
        {
          "quip": "What are you talking about...? Oh, he's already gone.",
          "target": -1
        }
      ]
    },
    {
      "id": 10,
      "line": [
        "Who knows what would have happened. Seriously, man. Thanks."
      ],
      "responses": [
        {
          "quip": "What's this? Finn acting serious? What have I done?",
          "target": 15
        }
      ]
    },
    {
      "id": 11,
      "line": [
        "It's my specialty, friendo. You got anything you want to do first since you're back?"
      ],
      "responses": [
        {
          "quip": "Not really, just visiting with everyone again.",
          "target": 16
        },
        {
          "quip": "I'm on my way to see my mother again. It's been too long.",
          "target": 17
        }
      ]
    },
    {
      "id": 12,
      "line": [
        "Well, I'm glad I spotted you, then. I gotta get back to work, but I'll talk to you later, yeah?"
      ],
      "responses": [
        {
          "quip": "Of course, man. Talk to you later.",
          "target": -1
        },
        {
          "quip": "Maybe later, Finn. Good bye.",
          "target": -1
        }
      ]
    },
    {
      "id": 13,
      "line": [
        "Ah, she's so sweet, man. Whenever I go to visit her, I swear I can't leave without getting a pie or an armful of cookies."
      ],
      "responses": [
        {
          "quip": "Sounds like her. Talk to you later, man.",
          "target": -1
        },
        {
          "quip": "I do miss her cooking more than anything. Good bye, Finn.",
          "target": -1
        }
      ]
    },
    {
      "id": 14,
      "line": [
        "What?! He's crazy, man. How does he even get out?"
      ],
      "responses": [
        {
          "quip": "Right? Well, I went to go get him, and he started howling up a storm. I swear he was singing a song.",
          "target": 18
        }
      ]
    },
    {
      "id": 15,
      "line": [
        "Oh, shut up. Don't you have somewhere to be?"
      ],
      "responses": [
        {
          "quip": "Yeah, man, I'm going to see my mom. I'll talk to you later.",
          "target": -1
        }
      ]
    },
    {
      "id": 16,
      "line": [
        "I'm glad I saw you, then. I gotta get back to work now, talk to you later."
      ],
      "responses": [
        {
          "quip": "Yeah, see you later.",
          "target": -1
        }
      ]
    },
    {
      "id": 17,
      "line": [
        "Ah, I would be myself if I were you. I'll talk to you later, man."
      ],
      "responses": [
        {
          "quip": "Yeah, see you.",
          "target": -1
        }
      ]
    },
    {
      "id": 18,
      "line": [
        "Pshh. Sure he was."
      ],
      "responses": [
        {
          "quip": "I'm telling you, he was! It was a pretty nice tune, too.",
          "target": 19
        }
      ]
    },
    {
      "id": 19,
      "line": [
        "Great. I wanted to hear about you running through an orc camp leaving no heads left on shoulders, and instead I get a tall tale about a dumb dog I see every goddamn day."
      ],
      "responses": [
        {
          "quip": "Hey, you asked for a story, man. Anyways, you need to get back to work. I'm sure you're skipping out on work, and I need to see my mom.",
          "target": 20
        }
      ]
    },
    {
      "id": 20,
      "line": [
        "I would never skip out on work. Ha ha.",
        "Ha...",
        "Bye."
      ],
      "responses": [
        {
          "quip": "Bye, Finn.",
          "target": -1
        }
      ]
    }
  ],
  "Seymour": [
    {
      "id": 0,
      "line": [
        "CORBYN!"
      ],
      "responses": [
        {
          "quip": "AHH!",
          "target": 1
        },
        {
          "quip": "Ugh, not this again.",
          "target": 2
        }
      ]
    },
    {
      "id": 1,
      "line": [
        "Saved our town from unspeakable evil and still frightened by me?",
        "As it should be."
      ],
      "responses": [
        {
          "quip": "Somebody had to do it Seymour!",
          "target": 2
        },
        {
          "quip": "Ugh, not this again.",
          "target": 31
        }
      ]
    },
    {
      "id": 2,
      "line": [
        "And you weren't ready!"
      ],
      "responses": [
        {
          "quip": "No. I wasn't.",
          "target": 4
        },
        {
          "quip": "The hell I wasn't. It's dead isn't it?",
          "target": 3
        }
      ]
    },
    {
      "id": 4,
      "line": [
        "Something does seem off about you. Are you alright?"
      ],
      "responses": [
        {
          "quip": "Of course I am Seymour.",
          "target": 5
        },
        {
          "quip": "Just exhausted from the journey and happy to be home.",
          "target": 20
        },
        {
          "quip": "Not exactly. I'm off to see Amelia, is she home?",
          "target": 23
        }
      ]
    },
    {
      "id": 5,
      "line": [
        "I don't believe you, but if you want to hide it it's not my place to pry.",
        "You will need to explain to Amelia however."
      ],
      "responses": [
        {
          "quip": "I will. Is she at home? I was on my way to her.",
          "target": 6
        },
        {
          "quip": "You worry too much Seymour",
          "target": 8
        }
      ]
    },
    {
      "id": 6,
      "line": [
        "She is. Other than Finn and myself she hasn't been getting too much company either."
      ],
      "responses": [
        {
          "quip": "I want to see her, do you mind if I go?",
          "target": 7
        }
      ]
    },
    {
      "id": 7,
      "line": [
        "No. You should go. Goodbye Corbyn."
      ],
      "responses": [
        {
          "quip": "Goodbye",
          "target": -1
        }
      ]
    },
    {
      "id": 8,
      "line": [
        "I find that all my years of life have led me to worry just the right amount.",
        "You seem to worry too little."
      ],
      "responses": [
        {
          "quip": "Don't be so dramatic",
          "target": 9
        },
        {
          "quip": "I don't have much to worry about right now.",
          "target": 14
        }
      ]
    },
    {
      "id": 9,
      "line": [
        "Me? Dramatic? Pff Says the hero sauntering back into town."
      ],
      "responses": [
        {
          "quip": "Would you rather I didn't come back?",
          "target": 10
        },
        {
          "quip": "I could have died. Aren't you happy that I've returned?",
          "target": 11
        }
      ]
    },
    {
      "id": 10,
      "line": [
        "I would rather you hadn't left in the first place.",
        "Just go see your mother. I'm done talking with you."
      ],
      "responses": [
        {
          "quip": "Fine. Goodbye Seymour.",
          "target": -1
        }
      ]
    },
    {
      "id": 11,
      "line": [
        "Of course I'm happy, but you shouldn't have left in the first place.",
        "You aren't the same."
      ],
      "responses": [
        {
          "quip": "What are you talking about? I'm fine.",
          "target": 12
        },
        {
          "quip": "Yes, I have changed, but everything will be alright.",
          "target": 13
        }
      ]
    },
    {
      "id": 12,
      "line": [
        "No. The more I look, the more something seems wrong. You should go to Amelia now."
      ],
      "responses": [
        {
          "quip": "I was already on my way to see her. Goodbye Seymour.",
          "target": -1
        }
      ]
    },
    {
      "id": 13,
      "line": [
        "I should hope so. Go to see Amelia. She's always been the most worried, of course."
      ],
      "responses": [
        {
          "quip": "Sounds like her. Goodbye Seymour",
          "target": -1
        }
      ]
    },
    {
      "id": 14,
      "line": [
        "I can see that and it bothers me. You were never like this when you left."
      ],
      "responses": [
        {
          "quip": "Say Seymour, could you do me a favor?",
          "target": 15
        },
        {
          "quip": "I should get going. Amelia is at home right?",
          "target": 19
        }
      ]
    },
    {
      "id": 15,
      "line": [
        "I'm not doing you any favors you don't deserve."
      ],
      "responses": [
        {
          "quip": "I wan't you to visit Amelia more often",
          "target": 16
        },
        {
          "quip": "Oh don't worry about it then. I'm off to see Amelia now.",
          "target": 18
        }
      ]
    },
    {
      "id": 16,
      "line": [
        "That's a bit forboding don't you think? You are okay right?"
      ],
      "responses": [
        {
          "quip": "Of course. No need to worry as I said. I'm going to see her now. She's at home right?",
          "target": 17
        }
      ]
    },
    {
      "id": 17,
      "line": [
        "She is. Take care Corbyn."
      ],
      "responses": [
        {
          "quip": "You too Seymour.",
          "target": -1
        }
      ]
    },
    {
      "id": 18,
      "line": [
        "Goodbye, then."
      ],
      "responses": [
        {
          "quip": "Goodbye",
          "target": -1
        }
      ]
    },
    {
      "id": 19,
      "line": [
        "Yes she is, and worried sick no doubt. She will be very happy to see you well."
      ],
      "responses": [
        {
          "quip": "I hope so. goodbye Seymour.",
          "target": -1
        }
      ]
    },
    {
      "id": 20,
      "line": [
        "There seems to be more to that story."
      ],
      "responses": [
        {
          "quip": "There's really no lying to you is there?",
          "target": 21
        },
        {
          "quip": "Nope, that's that.",
          "target": 22
        }
      ]
    },
    {
      "id": 21,
      "line": [
        "No, but it's clear you don't want to talk about it, so I won't pry."
      ],
      "responses": [
        {
          "quip": "Thanks Seymour. I'm going to head home now. Bye.",
          "target": -1
        }
      ]
    },
    {
      "id": 22,
      "line": [
        "Yes I'm sure. I assume you are on your way to see Amelia. She's at home right now."
      ],
      "responses": [
        {
          "quip": "Thank you. I'll be on my way.",
          "target": -1
        }
      ]
    },
    {
      "id": 23,
      "line": [
        "She is, and I'm sure she will be very happy to see you."
      ],
      "responses": [
        {
          "quip": "I hope so. Goodbye Seymour.",
          "target": -1
        }
      ]
    },
    {
      "id": 24,
      "line": [
        "While that may be, you are no longer yourself.",
        "Something that could have been prevented had you waited to grow up first."
      ],
      "responses": [
        {
          "quip": "I should have, but there was no time.",
          "target": 25
        },
        {
          "quip": "You certainly didn't grow any more fun to talk to while I was away.",
          "target": 28
        }
      ]
    },
    {
      "id": 25,
      "line": [
        "You weren't a hero when you left, someone could have gone in your place!"
      ],
      "responses": [
        {
          "quip": "Sometimes I wish that someone else did.",
          "target": 26
        },
        {
          "quip": "But I'm a hero now. People change Seymour",
          "target": 27
        }
      ]
    },
    {
      "id": 26,
      "line": [
        "Your mother too. You should go see her. She should be at home"
      ],
      "responses": [
        {
          "quip": "Bye Seymour",
          "target": -1
        }
      ]
    },
    {
      "id": 27,
      "line": [
        "I don't think you've changed for the better."
      ],
      "responses": [
        {
          "quip": "Thanks. I'll be leaving now.",
          "target": -1
        }
      ]
    },
    {
      "id": 28,
      "line": [
        "And you certainly haven't grown any more polite despite all my efforts when you were younger."
      ],
      "responses": [
        {
          "quip": "The adventuring roughed my edges I suppose",
          "target": 29
        },
        {
          "quip": "Hey, if you don't use it you lose it.",
          "target": 30
        }
      ]
    },
    {
      "id": 29,
      "line": [
        "They certainly have. I hope you remember to be nice to your mother at least."
      ],
      "responses": [
        {
          "quip": "Of course I will Seymour. Thank you and goodbye.",
          "target": -1
        }
      ]
    },
    {
      "id": 30,
      "line": [
        "And you certainly have lost it. I hope you can remember the basics for your mother at least."
      ],
      "responses": [
        {
          "quip": "Of course I will Seymour. Thank you and goodbye.",
          "target": -1
        }
      ]
    },
    {
      "id": 31,
      "line": [
        "Don't give me that. I told you you weren't ready and you left anyways.",
        "You deserve worse than a scolding from an old man"
      ],
      "responses": [
        {
          "quip": "Come on Seymour, I'm the Hero! Isn't there any room to spare here?",
          "target": 32
        },
        {
          "quip": "I'm not going to waste what little time I have left being yelled at by you.",
          "target": 33
        }
      ]
    },
    {
      "id": 32,
      "line": [
        "You are still a child in my eyes.",
        "You do seem different though, are you alright?"
      ],
      "responses": [
        {
          "quip": "Of course I am!",
          "target": 5
        },
        {
          "quip": "Just exhausted from my journey and happy to be home is all.",
          "target": 20
        },
        {
          "quip": "Not exactly. I would like to see Amelia. is she home right now?",
          "target": 23
        }
      ]
    },
    {
      "id": 33,
      "line": [
        "What do you mean by 'little time?'"
      ],
      "responses": [
        {
          "quip": "Goodbye Seymour",
          "target": -1
        }
      ]
    }
  ],
  "Amelia": [
    {
      "id": 0,
      "line": [
        "Corbyn."
      ],
      "responses": [
        {
          "quip": "Mother, I'm home.",
          "target": 1
        }
      ]
    },
    {
      "id": 1,
      "line": [
        "I've missed you so much dear. I'll put on some coffee, tell me about your travels."
      ],
      "responses": [
        {
          "quip": "Sure mom. Anything you want.",
          "target": 3
        },
        {
          "quip": "Maybe another time mom.",
          "target": 4
        }
      ]
    },
    {
      "id": 3,
      "line": [
        "Everything I want just walked in the front door. What can I do for you honey?"
      ],
      "responses": [
        {
          "quip": "Just talk with me.",
          "target": 4
        }
      ]
    },
    {
      "id": 4,
      "line": [
        "What's wrong dear? You sound sad."
      ],
      "responses": [
        {
          "quip": "Nothing is wrong mom, I'm just happy to see you.",
          "target": 5
        },
        {
          "quip": "I'm not well",
          "target": 5
        }
      ]
    },
    {
      "id": 5,
      "line": [
        "I know something is wrong dear. No matter how much you change I will be able to tell."
      ],
      "responses": [
        {
          "quip": "I know mom.",
          "target": 6
        }
      ]
    },
    {
      "id": 6,
      "line": [
        [
          "Well dear? What is it?",
          "You know you can tell me anything."
        ]
      ],
      "responses": [
        {
          "quip": "You know, when I left on my journey, I was so scared that I would never be able to come back.",
          "target": 7
        }
      ]
    },
    {
      "id": 7,
      "line": [
        "Well you are home now. There is nothing to fear anymore."
      ],
      "responses": [
        {
          "quip": "As the days passed and I grew stronger. I left that fear behind thinking that nothing, not even dragons, could stop me.",
          "target": 8
        }
      ]
    },
    {
      "id": 8,
      "line": [
        "And nothing did, right?"
      ],
      "responses": [
        {
          "quip": "When I fought the last evil, I reacted without fear of death.",
          "target": 9
        }
      ]
    },
    {
      "id": 9,
      "line": [
        "Everything is alright. Right Corbyn?"
      ],
      "responses": [
        {
          "quip": "I had to use every last bit of my power to defeat it...",
          "target": 10
        }
      ]
    },
    {
      "id": 10,
      "line": [
        "Corbyn?"
      ],
      "responses": [
        {
          "quip": "... and I have none left now.",
          "target": 11
        }
      ]
    },
    {
      "id": 11,
      "line": [
        "Everything is okay dear. We can fix it. Things will go back to the way they were."
      ],
      "responses": [
        {
          "quip": "When I left, I told you that I would come back and... Here I am at long last.",
          "target": 12
        }
      ]
    },
    {
      "id": 12,
      "line": [
        "Corbyn I love you. Please don't leave again. This isn't fair!"
      ],
      "responses": [
        {
          "quip": "With just enough of me to say one last thing.",
          "target": 13
        }
      ]
    },
    {
      "id": 13,
      "line": [
        "Please..",
        "Corbyn.",
        "A parent should never outlive there child."
      ],
      "responses": [
        {
          "quip": "I love you so much mom. Goodbye.",
          "target": -1
        }
      ]
    }
  ]
}